/**
 * Created by alekseysamoylov on 7/30/16.
 */
(function () {
    var app = angular.module('orderText', []);

    app.controller('OrderController', function ($scope) {
        $scope.textOrder = "";
        $scope.advices = [
            {
                id: 1,
                name: "Диагностика подвески",
                description: "Диагностика подвески \n" +
                "\n" +
                "▢	Амортизаторы\n" +
                "______________________________________________________\n" +
                "▢	Опорные подшипники\n" +
                "______________________________________________________\n" +
                "▢	Ступичные подшипники\n" +
                "______________________________________________________\n" +
                "▢	Шаровые\n" +
                "______________________________________________________\n" +
                "▢	Сайлент блоки рычагов\n" +
                "______________________________________________________\n" +
                "▢	Рулевые наконечники\n" +
                "______________________________________________________\n" +
                "▢	Рулевые тяги\n" +
                "______________________________________________________\n" +
                "▢	Рулевая рейка/редуктор\n" +
                "______________________________________________________\n" +
                "▢	Стабилизатор\n" +
                "______________________________________________________\n" +
                "▢	Стойки стабилизатора\n" +
                "______________________________________________________\n" +
                "▢	Тормозные шланги\n" +
                "______________________________________________________\n" +
                "▢	Тормозные колодки\n" +
                "______________________________________________________\n" +
                "▢	Тормозные диски\n" +
                "______________________________________________________\n" +
                "▢	Состоянии приводных валов(шрусы,крестовины,пыльники) \n" +
                "______________________________________________________\n" +
                "▢	Герметичность системы смазки ДВС/ГУР/КПП \n" +
                "______________________________________________________\n" +
                "▢	Герметичность охлаждающей системы \n" +
                "______________________________________________________\n" +
                "▢	Уровень тормозной жидкости__________________________\n \n"

            },
            {
                id: 2,
                name: "Диагностика двигателя",
                description: "Диагностика двигателя \n" +
                "▢	Исправность и состояние аккумулятора\n" +
                "______________________________________________________\n" +
                "▢	Состояние свечей зажигания\n" +
                "______________________________________________________\n" +
                "▢	Напряжение аккумулятора (показания датчика)\n" +
                "______________________________________________________\n" +
                "▢	Замер компрессии \n" +
                "______________________________________________________\n" +
                "▢	Уровень масла в ДВС (состояние визуально проверить)\n" +
                "______________________________________________________\n" +
                "▢	Проверка высоковольтных проводов (повреждения)\n" +
                "______________________________________________________\n" +
                "▢	Уровень масла в АКПП (КПП) (визуально проверить)\n" +
                "______________________________________________________\n" +
                "▢	Проверка катушек зажигания\n" +
                "______________________________________________________\n" +
                "▢	Состояние масла в АКПП (КПП)(визуально проверить)\n" +
                "______________________________________________________\n" +
                "▢	Проверка давления топлива\n" +
                "______________________________________________________\n" +
                "▢	Проверка стартера на пост. Шум.\n" +
                "______________________________________________________\n" +
                "▢	Состояние воздушного фильтра\n" +
                "______________________________________________________\n" +
                "▢	Проверка ДВС на предмет течи масла\n" +
                "______________________________________________________\n" +
                "▢	Датчик температуры  воздуха\n" +
                "______________________________________________________\n" +
                "▢	Проверка лямбда зонд (работа)\n" +
                "______________________________________________________\n" +
                "▢	Датчик оборотов\n" +
                "______________________________________________________\n \n"

            },
            {
                id: 3,
                name: "Замена масла",
                description: "Замена масла \n" +
                "▢	Слить масло и сразу затянуть сливную пробку\n" +
                "______________________________________________________\n" +
                "▢	Заменить масляный фильтр \n" +
                "______________________________________________________\n" +
                "▢	Залить новое масло\n" +
                "______________________________________________________\n" +
                "▢	Заменить воздушный фильтр\n" +
                "______________________________________________________\n" +
                "▢	Заменить салонный фильтр\n" +
                "______________________________________________________\n" +
                "▢	Завести двигатель, проверить погасание лампы давления масла,\n" +
                "герметичность системы и уровень масла.\n" +
                "______________________________________________________\n \n"
            },
            {
                id: 4,
                name: "Замена колодок",
                description: "▢	Заменить передние, задние тормозные колодки"
            },
            {
                id: 5,
                name: "Замена ремня ГРМ",
                description: "▢	Заменить ремень ГРМ, натяжные ролики, проверить состояние помпы"
            },
            {
                id: 6,
                name: "Заменить шаровую",
                description: "▢	Заменить шаровую"
            },
            {
                id: 7,
                name: "Заменить сайлентблок",
                description: "▢	Заменить сайлентблок"
            },
            {
                id: 8,
                name: "Заменить рулевой наконечник",
                description: "▢	Заменить Шаровую"
            },
            {
                id: 9,
                name: "Заменить ШРУС (гранату)",
                description: "▢	Заменить ШРУС (гранату)"
            }

        ];
        $scope.textFunc = function (text) {
            $scope.textOrder = $scope.textOrder + text + "\n";
        }


    });
})();

